app/controllers/user/sessions_controller.rb

UPDATE "users" SET "current_sign_in_at" = ?, "sign_in_count" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["current_sign_in_at", "2020-05-08 14:54:10.751040"], ["sign_in_count", 2], ["updated_at", "2020-05-08 14:54:10.751450"], ["id", 1]]
---
  def create
    super
    current_user.update_attribute(:logged_in, true)

UPDATE "users" SET "logged_in" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["logged_in", 0], ["updated_at", "2020-05-08 14:56:28.573765"], ["id", 2]]
---
  def destroy
    current_user.update_attribute(:logged_in, false)