app/controllers/tweeets_controller.rb

  def index
    @tweeets = Tweeet.all.order('created_at DESC')
---
SELECT "tweeets".* FROM "tweeets" ORDER BY created_at DESC

  def create
    @tweeet = current_user.tweeets.build(tweeet_params)

    respond_to do |format|
      if @tweeet.save
---
INSERT INTO "tweeets" ("tweeet", "created_at", "updated_at") VALUES (?, ?, ?)  [["tweeet", "This is my first tweet..."], ["created_at", "2020-05-08 10:41:23.584487"], ["updated_at", "2020-05-08 10:41:23.584487"]]

  def set_tweeet
    @tweeet = Tweeet.find(params[:id])
---
SELECT "tweeets".* FROM "tweeets" WHERE "tweeets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]